<?php
/**
 * Массив событий модуля.
 * Формат элемента - соответствие полям таблицы b_module_to_module:
 * <ul>
 *         <li> ['FROM_MODULE_ID']  <i><u>string</u></i> Модуль генерирующий событие </li>
 *         <li> ['MESSAGE_ID']      <i><u>string</u></i> Наименование события </li>
 *         <li> ['TO_MODULE_ID']    <i><u>string</u></i> Модуль обработчика события (текущий) </li>
 *         <li> ['TO_CLASS']        <i><u>string</u></i> Класс метода обработчика </li>
 *         <li> ['TO_METHOD']       <i><u>string</u></i> Метод обработчик </li>
 *         <li> ['SORT']            <i><u>int</u></i> Сортировка порядка вызова обработчиков </li>
 * </ul>
 */
$MODULE_EVENTS = [

    /****************************************** MAIN ******************************************/

    /****************************************** CATALOG ******************************************/

    /****************************************** HLBLOCK ******************************************/

    /****************************************** IBLOCK ******************************************/

    /******************************************* SALE *******************************************/

    /******************************************* FORM *******************************************/

    [
        '',
        '',
        'dvk.feature',
        '',
        '',
        100,
        false, // compatible
    ],
];

